package JavaBasic.src.club.banyuan.basic;

/**
 * @author nijing
 * @date 2020/11/9 7:08 下午
 * @override 1.0
 */
public class Practice {
    public static void main(String[] args) {
        /**
         * 如何验证小数字面量默认值是double数据类型的，请将代码说明记录到答案中
         */
        int num = 789652;
        int len = (num+"").length();
        int len2 = len;
        int count = 0;

        while(len > 0){
            int r2 = num;
            for(int i=0; i<len-1; i++){
                r2 = r2 / 10;
            }
            if(len < len2){
                r2 = r2 % 10;
            }
            count = count + r2;
            len--;
        }
//        System.out.println(count);

        /**
         *  -8 & 8
         *
         *  1000 0000 0000 0000 0000 0000 0000 1000  -8 源码
         *  1111 1111 1111 1111 1111 1111 1111 1000  -8 补码
         *  0000 0000 0000 0000 0000 0000 0000 1000   8 补码
         *  0000 0000 0000 0000 0000 0000 0000 1000  结果 8
         *
         *
         *  ～7
         *  0000 0000 0000 0000 0000 0000 0000 0111
         *  1111 1111 1111 1111 1111 1111 1111 1000  结果 -8
         *
         *  8^9
         *  0000 0000 0000 0000 0000 0000 0000 1000
         *  0000 0000 0000 0000 0000 0000 0000 1001
         *  0000 0000 0000 0000 0000 0000 0000 0001  结果 1
         *
         * -8 ^ 9
         *  1000 0000 0000 0000 0000 0000 0000 1000 -8 源码
         *  1111 1111 1111 1111 1111 1111 1111 1000 -8 补码
         *  0000 0000 0000 0000 0000 0000 0000 1001 9 补码，源码
         *  1111 1111 1111 1111 1111 1111 1111 0001
         *  1111 1111 1111 1111 1111 1111 1111 0000
         *  1000 0000 0000 0000 0000 0000 0000 1111 结果 -15
         *
         *  9 | 7
         *  0000 0000 0000 0000 0000 0000 0000 1001
         *  0000 0000 0000 0000 0000 0000 0000 0111
         *  0000 0000 0000 0000 0000 0000 0000 1111  结果 15
         *
         */

        System.out.println(-8 & 8);
        System.out.println(~7);
        System.out.println(8 ^ 9);
        System.out.println(-8 ^ 9);
        System.out.println(9|7);

    }

    public static String getType(Object o) {
        return o.getClass().toString();
    }
}
